---
kind: other
id: Properties.T:Autodesk.Revit.DB.DirectContext3D.VertexStreamPosition
source: html/1b9f9d75-46c1-555b-473c-42c2a1ed88fc.htm
---
# VertexStreamPosition Properties

Specifies whether the .NET object represents a valid Revit entity.